#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fedc4b5-1941-4368-8c93-be590b0670f8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3559989c-f390-416f-b178-dde31ae043eb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3cf62cff-4c51-4df1-9c03-0747d294026c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e79c1fb-5081-4b53-b637-6b42cec40c12]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=30f18071-66dd-4d05-ab42-ca8ba6098ad0]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6f59d5e7-b118-461d-97c7-cbcba6290356]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0d093c22-ba7c-4d85-94bc-e3430d06f4fe]
module.keycloak_dev.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2412db85-f052-4c36-8c74-953f66a06990]
module.keycloak_dev.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=97eda933-51eb-48ca-8ed4-79263d70a171]
module.keycloak_dev.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=90359349-f3ad-480d-b75c-7f7072f0789b]
module.keycloak_dev.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8df3adc2-58b4-45fc-8e00-b1e6c1476cbc]
module.keycloak_dev.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=acd2f323-c56b-4fdb-943b-53032cff2025]
module.keycloak_dev.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=09ef04b1-d6fc-4fac-81d6-f2169bb5135f]
module.keycloak_dev.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3b483824-1ff1-43bc-98d3-e7269d22fb78]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5413a1d5-a2bc-4f9f-8440-2da8dc403054]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b6e2d7e1-2929-4a44-9a1e-eecf4c6de1a8]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6225011c-5741-48a3-a404-690e02187b2b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8c3aee31-3930-4812-ae12-013a3034bac0]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=eb6776cb-7891-4d2b-b2ab-3cf976b90d60]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c66aa09a-79b1-4c36-88c3-aaab7e7a6376]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=599be727-c162-4be4-9281-fdea59fedd87]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=99ffa2ac-d2f0-4891-a4cb-e5995275f66a]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9bbbb147-8a84-49b3-a0bf-3ef8da612f54]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8922455-5068-4300-add2-dc1604ebf9ee]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a1c0c79-82b1-4433-aec2-04139bd9e83c]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0f6f8dd9-b6af-48e0-8662-7a4de1b675c4]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7b14c264-b280-422b-b073-ac2200b070e7]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=05224e67-b8fa-443b-871f-acb3040e8bbb]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2d419037-b4e9-46d8-8086-c4cf6c7c8c0b]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=02f2fd47-1380-45b8-b560-103d7f38120f]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=10a3e50b-66b2-463f-a037-27641c4f27af]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3b2c1c88-899d-4382-9137-8e34ee0f4028]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3f2788ac-3c3c-4617-a32b-9561bfeb7be4]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=71a56d25-9eae-4df0-9e12-fdcb13a9043a]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=85a6c15a-e0a6-4c9a-aa4f-e8a71a799d97]
module.keycloak_dev.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=17ffb50b-e7d1-41f8-8024-eb6be0840829]
module.keycloak_dev.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cb59b91f-d0c6-442d-a8da-21b9be61626f]
module.keycloak_dev.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2f27e6f-c926-4cfa-8293-2184dd430065]
module.keycloak_dev.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=55158dc0-4b52-4623-aefc-9abc957c2743]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=624232c4-9a34-4c83-b103-21fddc209e2a]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a8528ccb-998e-4ca8-923b-ff4b66258cab]
module.keycloak_dev.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e73200e3-a317-4217-b486-f0573f0f2521]
module.keycloak_dev.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=57095a4f-dcab-4aab-ad05-94ed22fe8abc]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dba26b00-e3d2-42d6-a77b-3ca68d240f8c]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f137a67a-d37e-4cfb-80c7-7cebbee7dda8]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e3683e2-7310-407f-91f6-3a64297dc90b]
module.keycloak_dev.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec008fd4-569f-4687-bbb1-e0465b238e06]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=60b4e3b4-5913-431f-bb01-bd94f9822d6f]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f84f8b82-f177-48a1-9a70-3b374ac8a655]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=51f4c792-44ac-4cf6-9d71-6f5e95fa7bbb]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ce3053ff-d553-4b63-bfd1-3b82f87f977c]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=59886227-c5cc-4819-b346-ff3853c8d3f4]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a5152ade-230c-45b8-827c-ff12b3622924]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=63344caa-d4b5-49f9-8da2-b3e04c3843d0]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8a263f36-6a9e-4354-b081-a65307b6f5d4]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=50d10ec2-4cf1-4af7-8c92-91cc5b91259b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fce77ec9-bf10-45fc-8036-6b3a7e3da42b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28a6c18b-6277-44e7-ab77-c9cf786b7059]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=df9bdce5-dc0d-4292-9a77-8a5b27569056]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6bc93bd1-34a3-45bb-ba59-0f80457c55d4]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=96e3f864-4bc7-40ff-b35d-d4b6ca8776c2]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9aa05a12-d3f3-478a-8864-a8b80ff52aff]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=618c409f-0ca6-4c05-8621-fcdaa8828f9e]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2f373551-5dfa-4871-9b64-7842ce3be63b]
module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=de1b0aa4-9944-457e-9984-78443cb8a8d9]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5077806e-6f24-4978-87e0-d107f5766174]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8aebb00-ae20-4a63-ab4c-439313c536fa]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3b91fdc2-3e61-4481-b6c9-55f044b76a39]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a46b9e29-bcfb-45f6-b769-3cf9086a2b81]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=15ff4ea0-70ea-441f-b423-8bd2e53c7fef]
module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b4608bab-13b8-471d-a468-2b0318ece9f0]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbc1d716-2a45-459d-86cd-d16b42d6604e]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ff6c8d6b-3965-47d0-8915-dca8b06bdf52]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5ba3baf8-c971-484a-bf4a-e652e1fea0f4]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1ca2c8f-9b82-4912-a92e-dcf363b8623b]
module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=465be8d6-1a64-4a1f-beca-592e9d30be40]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d78b6009-272c-4300-8c40-aed74d3d3eeb]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=36beca1e-334f-47d0-af66-e97413be0586]
module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=68abc6ba-494b-4190-9d71-ede180515f4a]
module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f08e31c2-9e02-460b-a972-5ee07aff8d90]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a368e938-e442-4faa-a347-83c80154fb63]
module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c514ff93-f7f3-45f9-bb50-d3a4f1aa9114]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=be5a6b1c-703b-4671-8239-b74f8352e5f1]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a1f63c9-8b52-46e8-976c-6b475d33a12c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=81ec1bdd-ac1e-45b5-a2a7-923c61fce091]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bf1e1545-c8b8-409f-8ae5-27a075372507]
module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0ad94886-6a42-4d08-b395-f9eaa8c0e059]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73a01703-e426-493a-8a55-a370969aebd1]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=db295ab1-fc62-4710-b041-1a280bd674d7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=375fbf7f-3bca-4849-b17a-04d632b0cea4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=46755eb2-0df6-4bfe-b2ce-3e7c891312ff]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=38153cb0-ed55-408b-ba7f-762efedd86cb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d03ca8c0-076a-49ee-b9c7-c885a51fdc0d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=41894bb2-7d48-4e42-aede-7f9d81df1c2a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=85fb3271-c5a0-4935-b423-937806e53af7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4fcc052b-d3e3-4515-ab43-c0f74b0d3d45]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=82621594-063a-4fda-b4af-5070134fe34a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-930-am-2674.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=359103f8-356a-486c-90eb-6762f3602af2]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2622fe34-878b-42cc-8f07-643c7eec7a56]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bfa4e54c-a49d-4d79-8eb5-e7c3e019f67e]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=54031ea8-8feb-4baf-9f01-cd0350e79c21]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2dceb657-c062-4745-893b-321a5f61439d]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c4d723cc-a45f-4c1e-b4dc-09c394b44904]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=023943ea-5c9b-4169-a6b3-568c77b5638e]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ba68540d-e15d-4c70-96d3-274af865a4ba]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=41a127b0-5114-46c6-bea6-47c40ad6e18d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b603cd1d-36d0-4ee3-b92b-12d65a308112]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d17dd5ab-c7e4-4ab9-b50d-433d2ab0db07]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1bed6e2e-ba8e-435c-994a-dd229a49f9d1]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5147dd4-259c-4487-bbbf-9b7ea87f314c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1228035e-160a-4059-be47-ad2fdd3f6d2a]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc7f6a47-0e3a-4f2f-9921-1d908e2277c2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6c4f57b5-6814-4ac6-8466-25917eb885ac]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b379ada4-dfdd-42f4-818c-2ec3a92ad4a0]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=14a63c25-5444-4943-8bfa-53520c4e2861]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8ee461d-80a8-4027-a8dd-07573e4d4b35]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=54e80cc7-ebf7-48b0-880e-efa628c7ee70]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=583325d5-1108-4dc3-a278-a11dfb024c27]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=88561a69-cd7d-4381-a942-2422f0d02936]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=802cd761-f519-45cc-97d4-024e3cb7f8b7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1f8477a8-9469-4178-8961-02ed2da74010]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=899ff4df-5513-47d9-9984-159efbad59ad]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f32acbb7-bf93-4b76-a104-99d74df97f59]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3ad1d3b0-ee8d-4246-ba21-cd01d2786281]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=59b7ccff-ffa1-45fd-a2c4-a0db7d1cc454]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a564a503-cd0e-4ecb-ad80-6345c90fefc6]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0e41cb5-7782-4314-81ee-445364b0753c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f7e3930-cf59-430e-a675-78cfb092d685]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fc75240d-2577-4ef3-9b83-67a00b42ec3b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a049900-08f0-455d-8e60-117d6b1b65e8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f9f98243-d304-4942-9acb-1f529fee9b82]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c0d6ed1-4c9c-4d2e-b6ec-6cb3bcd69066]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbb05648-86cd-4149-9560-8ac56cc9394d]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=09da8d35-2321-41e1-8426-6537bd712ae7]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d42b3a81-89b2-42fc-977e-0c45d9b87987]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=86ad2c8f-b41a-4a06-ad81-a2b6c51bbb0f]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3b1f8ff0-6edf-4f1f-a087-2481899ca10b]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f3cc3d8a-9ee3-4d88-92be-dd2fda53843c]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6030c6f8-c209-4a1f-91e4-11f2fdf2a915]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=85ff5804-4e1b-4cbd-aa2b-63c9599253fe]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=23bf5767-8186-4afc-83c8-c07b3ee1f5f9]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=735ef5cc-f171-4b01-9154-9a58908f2713]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=15b25011-e2f9-4624-aa95-ec31762efd41]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aaec779c-3997-4bd1-9110-053ac3562a1e]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5c549940-4259-483d-9e8c-58798d94783d]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d2abfa5d-7227-45c4-9007-6168a20c2236]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd1e36d8-5e78-4051-a411-74aecb4521a4]
module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b0bdf3b-67ea-4e7c-a559-9202d2a2152a]
module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3c381408-fd6e-4149-9c93-f01579e084ad]
module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=868088c8-e6d3-43ec-a135-404f5443110f]
module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=419c5e24-1fd1-4b94-82ee-1358a5a9713e]
module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=52326ad0-eec5-43c4-906b-1aa0324466f2]
module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e12a9ddc-d378-43af-bf97-d5fb5dacf5ae]
module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=88e0cb69-b18b-4e4d-bc85-7e25f442c3fd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-no-prod-3103"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-no-prod-3103"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-no-prod-3103"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-no-prod-3103"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://dev",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-no-prod-3103"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-no-prod-3103"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-no-prod-3103"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-no-prod-3103"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2880 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*